{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "44e1c0eb-f948-4ea5-8dd7-9d6ed73972d7",
   "metadata": {},
   "source": [
    "### DOCUMENTATION"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "02c7f0da-287b-4ef5-83cd-87e367c83891",
   "metadata": {},
   "source": [
    "Στα πλαίσια του Εργαστηριακού Μαθήματος <i> Όψεις του Διαδικτύου - Κριτικές Προσεγγίσεις </i> με καθηγητή τον Παντελή Βατικιώτη και συνεργάτες τους Κέλλυ Κική, Θανάση Τρομπούκη και Χρυσούλα Μαρίνου, μελετήσαμε την αύξηση της μέσης μεταβολής της επιφάνειας της γης και την αύξηση των ακραίων φαινομένων σε Ελλάδα, Ιταλία, Πορτογαλία, και Ισπανία για το διάστημα 1972-2022."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4fda9f2c-d8f6-4f73-bcf8-2df8f8ab4e55",
   "metadata": {},
   "source": [
    "Τα δεδομένα για τις θερμοκρασίες συλλέχθηκαν από [climatedata.imf.org](https://climatedata.imf.org/datasets/4063314923d74187be9596f10d034914/explore), το οποίο περιλαμβάνει στοιχεία της ετήσιας εκτίμησης της μέσης μεταβολής της θερμοκρασίας της επιφάνειας που μετρήθηκαν σε σύγκριση με τον μέσο όρο της χρονικής βάσης 1951-1980. Οι χώρες που μελετώνται είναι η Ελλάδα, η Ισπανία, η Ιταλία και η Πορτογαλία, καθώς είναι μεσογειακές χώρες οπότε θεωρούνται συγκρίσιμες, στο σύνολο του διαστήματος 1972-2022.Το διάστημα χωρίζεται είτε σε δύο περιόδους 1972-1996 & 1992-2022, είτε σε δεκαετίες, για να μπορεί να γίνει σύγκριση. (Annual_Surface_Temperature_Change)\n",
    "\n",
    "Τα δεδομένα για τα ακραία φαινόμενα πάρθηκαν από τη βάση δεδομένων της [Emdat](https://public.emdat.be/), η οποία παρέχει πρόσβαση στη βάση δεδομένων έκτακτων συμβάντων, μια ολοκληρωμένη πηγή δεδομένων για περισσότερες από 26.000 παγκόσμιες καταστροφές από το 1900 έως σήμερα. Οι καταστροφές που επιλέχθηκαν να μελετηθούν είναι οι φωτιές, πλημμύρες, ακραίες θερμοκρασίες και καταιγίδες. (akraiafainomena_data)\n",
    "\n",
    "Αν και η βάση δεδομένων της [Emdat](https://public.emdat.be/) αποτελεί έγκυρη πηγή, η περιπλοκότητα των ακραίων φαινομένων και της καταγραφής τους αποτελεί δύσκολη υπόθεση. Σε ορισμένες περιπτώσεις, ο κύριος τύπος της καταστροφής μπορεί να είναι διαφορετικός απ'ότι σε άλλες βάσεις δεδομένων, ή μπορεί ακόμα κάποιο ακραίο φαινόμενο που έχει συμβεί σε μία συγκεκριμένη χώρα να έχει συνέπειες και σε κάποια γειτονική χώρα, και άρα, το φαινόμενο να καταχωρηθεί και στις 2 χώρες. Επίσης, όταν η βάση δεδομένων αναφέρει πως ενδεχομένως να λείπουν στοιχεία αναφέρεται κυρίως στα άλλα στοιχεία που περιλαμβάνει το dataset, τα οποία δεν χρησιμοποιήθηκαν στο συγκεκριμένο πρότζεκτ, όπως αριθμός τραυματιών, αριθμός θυμάτων. Τέλος, προβλήματα με την καταγραφή περιστατικών φαίνεται να υπάρχουν στις υπο-Σαχάριες χώρες λόγω απουσίας συστημάτων αναφοράς. Ξανά, το συγκεκριμένο πρότζεκτ δεν επηρεάζεται. \n",
    "Καταληκτικά, τα δεδομένα της βάσης είναι έγκυρα και δεν διαστρεβλώνουν τα αποτελέσματα της συγκεκριμένης έρευνας.\n",
    "\n",
    "\n",
    "Οι επεξεργασίες των δεδομένων έγιναν με γλώσσα προγραμματισμού python, συγκεκριμένα την βιβλιοθήκη pandas σε jupyter notebook.\n",
    "\n",
    "Από το πρώτο dataset για τις θερμοκρασίες κρατήθηκαν μόνο οι σειρές που αφορούν τις χώρες που μελετώνται, και οι στήλες για τις χρονολογίες από το 1972 έως το 2022.\n",
    "\n",
    "Από το δεύτερο dataset για τα φαινόμενα κρατήθηκαν μόνο οι σειρές που αφορούν τις χώρες και τα φαινόμενα που μελετώνται, καθώς και οι χρονολογίες 1972-2022.\n",
    "\n",
    "Τα τελικά datasets που δημιουργήθηκαν και χρησιμοποιήθηκαν είναι:\n",
    "\n",
    "- <b> merged_df </b> : πρόκειται για ένα dataset που αποτελεί σύνδεση των δύο προηγούμενων, καθώς περιέχει τις χρονολογίες, τις χώρες, τις τιμές της μέσης μεταβολής της θερμοκρασίας και τα περιστατικά ακραίων φαινομένων.\n",
    "- <b> merged2 </b> : παρόμοιο με το προηγούμενο, ωστόσο περιλαμβάνει ξεχωριστή στήλη για τον κάθε τύπο ακραίου φαινομένου.\n",
    "- <b> df5 </b> : περιλαμβάνει μόνο τις τιμές για την μέση μεταβολή της θερμοκρασίας. Η κάθε χώρα έχει τη δική της ξεχωριστή στήλη.\n",
    "- <b> akraiafain </b>: περιλαμβάνει μία στήλη για την χρονολογία, μία για τις χώρες, μία με τον τύπο φαινομένων και μία με τον υπότυπο. Ο υπότυπος δεν χρησιμοποιήθηκε μιας και δεν έδινε διαφορετικές πληροφορίες απ'ότι ο τύπος.\n",
    "- <b> disasters </b> : δημιουργήθηκε από το προηγούμενο dataset. Για την κάθε χώρα έχει βρεθεί το σύνολο των περιστατικών για τις δύο περιόδους 1972-1996 και 1997-2022. Επίσης έχει βρεθεί και το σύνολο των περιστατικών για την κάθε χώρα για όλο το διάστημα, δηλαδή από το 1972 έως το 2022.\n",
    "- <b> disasters_by_type </b> : παρόμοιο με το προηγούμενο dataset, ωστόσο σε αυτό γίνεται διαχωρισμός του τύπου ακραίων φαινομένων. Ισχύει ξανά ο διαχωρισμός σε δύο περιόδους, καθώς και το σύνολο των περιστατικών ανά χώρα και τύπο για ολόκληρο το διάστημα 1972-2022."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b97b5eb-7783-4bcd-b80a-c4acbb2a6cb2",
   "metadata": {},
   "source": [
    "#### Merged_df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0db480a9-d6e6-4ba5-990e-c230b92c19d5",
   "metadata": {},
   "source": [
    "Το dataset merged_df περιλαμβάνει 4 στήλες:\n",
    "\n",
    "- Α: Χρονολογία (από το 1972-2022 (year)\n",
    "- Β: Χώρες (Ισπανία, Ιταλία, Πορτογαλία, Ελλάδα) (country)\n",
    "- Γ: τη μέση μεταβολή της θερμοκρασίας της επιφάνειας (temp_change)\n",
    "- Δ: τα περιστατικά ακραίων φαινομένων συνολικά (event_cases)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "41ad231c-3db8-4f69-be31-720dd1694e97",
   "metadata": {},
   "source": [
    "#### Merged2"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6fc1a400-36e3-4292-ba34-a9c0b4f53a9a",
   "metadata": {},
   "source": [
    "Το dataset merged2 περιλαμβάνει 9 στήλες:\n",
    "\n",
    "- Α: Χρονολογία (από το 1972-2022) (year)\n",
    "- Β: Χώρες (Ισπανία, Ιταλία, Πορτογαλία, Ελλάδα) (country)\n",
    "- Γ: τη μέση μεταβολή της θερμοκρασίας της επιφάνειας (temp_change)\n",
    "- Δ: τα περιστατικά ακραίων φαινομένων συνολικά (event_cases)\n",
    "- Ε: ξεχωριστή στήλη για τα περιστατικά ακραίων θερμοκρασιών (disaster_subtype_extreme_temperature)\n",
    "- ΣΤ: ξεχωριστή στήλη για τα περιστατικά φωτιάς (disaster_subtype_wildfire)\n",
    "- Ζ: ξεχωριστή στήλη για τα περιστατικά πλημμήρας (disaster_subtype_flood)\n",
    "- Η: ξεχωριστή στήλη για τα περιστατικά καταιγίδων (disaster_subtype_storm)\n",
    "- Θ: ξεχωριστή στήλη για τη πλημμύρα λόγω έκρηξης παγετώνων λίμνης (disaster_subtype_glacial_lake_outburst_flood), η οποία στην συνέχεια θα συγχωνευτεί με την στήλη της πλημμύρας.\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d6a1b268-58cc-4550-8589-6e5326c92ef1",
   "metadata": {},
   "source": [
    "#### Df5"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07d2106e-1512-463c-bca3-05f6a812e08b",
   "metadata": {},
   "source": [
    "Το dataset df5 περιλαμβάνει 5 στήλες:\n",
    "\n",
    "- Α: Χρονολογία (από το 1972-2022 (year)\n",
    "- Β: Η μέση μεταβολή της θερμοκρασίας της επιφάνειας της εκάστοτε χρονολογίας σε σύγκριση με την βάση 1951-1980, για την Ελλάδα.\n",
    "- Γ, Δ , Ε : το ίδιο με το Β για την κάθε χώρα ξεχωριστά: Ισπανία, Ιταλία, Πορτογαλία.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "433ce404-33e9-45b1-a62e-495eb32d77d3",
   "metadata": {},
   "source": [
    "#### Akraiafain"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68b75724-33d1-445c-a737-968b895b314b",
   "metadata": {},
   "source": [
    "To dataset akraiafain περιλαμβάνει 4 στήλες:\n",
    "\n",
    "- Α: Χώρες(Ισπανία, Ιταλία, Πορτογαλία, Ελλάδα) (country)\n",
    "- Β: Χρονολογία (από το 1972-2022) (start_year)\n",
    "- Γ: Στήλη με τον τύπο καταστροφής (περιλαμβάνονται φωτιές, πλημμύρες, καταιγίδες, ακραίες θερμοκρασίες) (disaster_type)\n",
    "- Δ: Στήλη με τον υπότυπο καταστροφής (disaster_subtype)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a10ffbfd-d57e-445f-aea8-31ac5fae2f40",
   "metadata": {},
   "source": [
    "#### Disasters"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82d371ae-bafb-4dd9-8b4c-de6b4d248e3a",
   "metadata": {},
   "source": [
    "Το dataset disasters προκύπτει από την ανάλυση και επεξεργασία του προηγούμενου dataset με τίτλο akraiafain.\n",
    "Περιλαμβάνει 4 στήλες:\n",
    "\n",
    "- Α: Χώρες(Ισπανία, Ιταλία, Πορτογαλία, Ελλάδα) (country)\n",
    "- Β: Το σύνολο των περιστατικών ακραίων φαινομένων για το διάστημα 1972-1996 (1972-1996)\n",
    "- Γ: Το σύνολο των περιστατικών ακραίων φαινομένων για το διάστημα 1997-2022 (1997-2022)\n",
    "- Δ: Το άθροισμα των δύο προηγούμενων, δηλαδή το σύνολο των ακραίων περιστατικών για το διάστημα 1972-2022. (Total)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6accd8ba-9460-425c-8a84-068208c8e918",
   "metadata": {},
   "source": [
    "#### Disaster_by_type"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9cbb1e7-632e-4ed1-a51a-e78a71e0c2da",
   "metadata": {},
   "source": [
    "\n",
    "Το dataset disasters_by_type προκύπτει από την ανάλυση και επεξεργασία του προηγούμενου dataset με τίτλο akraiafain. Περιλαμβάνει 5 στήλες:\n",
    "\n",
    "- Α: Χώρες(Ισπανία, Ιταλία, Πορτογαλία, Ελλάδα) (country)\n",
    "- B: Στήλη με τον τύπο του ακραίου φαινομένου (Disaster Type)\n",
    "- Γ: Τα περιστατικά ακραίων φαινομένων ανά τύπο για το διάστημα 1972-1996 (1972-1996)\n",
    "- Δ: Τα περιστατικά ακραίων φαινομένων ανά τύπο για το διάστημα 1997-2022 (1997-2022)\n",
    "- Ε: Το άθροισμα των δύο προηγούμενων, δηλαδή τα περιστατικά ακραίων φαινομένων ανά τύπο για το διάστημα 1972-2022 (Total)\n",
    "\n",
    "Τύποι ακραίων φαινομένων: περιστατικά ακραίων θερμοκρασιών, περιστατικά φωτιάς, περιστατικά πλημμήρας, περιστατικά καταιγίδων, πλημμύρα λόγω έκρηξης παγετώνων λίμνης, η οποία στην συνέχεια θα συγχωνευτεί με την στήλη της πλημμύρας."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0bd28fc1-18b8-40ef-a4c3-17cc9b3e3a00",
   "metadata": {},
   "source": [
    "<b> Για τα dataset που περιλαμβάνουν τα περιστατικά ακραίων φαινομένων <i> merged_df, merged2 , akraiafain, disasters, disasters_by_type </i> : </b>\n",
    "\n",
    "Στην βάση δεδομένων της Emdat περιλαμβάνονται μόνο οι χρονολογίες που έχουν καταγραφεί περιστατικά ακραίων φαινομένων. Η κάθε σειρά αντιστοιχεί σε ένα περιστατικό. Για παράδειγμα, αν το 1972 στην Ισπανία δεν είχε γίνει κάποια πλημμύρα, δεν θα γράφει Ισπανία: Πλημμύρα:0, αλλά θα λείπει εντελώς η σειρά. Επίσης, αν το 1972 δεν είχε γίνει κανένα περιστατικό στην Ισπανία, δεν θα περιλαμβάνεται καθόλου η χρονολογία, αλλά θα προχωράει κατευθείαν στην επόμενη χρονιά που υπάρχουν περιστατικά. Η απουσία δεδομένων για μια χρονολογία στο dataset των περιστατικών δηλώνει ότι δεν υπήρξαν περιστατικά για τη συγκεκριμένη χρονολογία.\n",
    "\n",
    "Όταν έγινε συγχώνευση των δύο dataset, για τις θερμοκρασίες και τα φαινόμενα, συμπεριλήφθηκαν όλες οι ημερομηνίες, από το 1972 έως το 2022, καθώς το dataset με τις θερμοκρασίες περιείχε συνεχή δεδομένα για κάθε χρονολογία από το 1972 έως το 2022. Ο κώδικας ως default έβαλε κενές τιμές στις στήλες με τα περιστατικά για τις χρονολογίες που δεν προϋπήρχαν. Ωστόσο, αυτό θα ήταν λάθος, καθώς οι χρονολογίες αυτές δεν έχουν πράγματι κενές τιμές, αλλά δεν περιλαμβάνονται εξαρχής στο dataset επειδή δεν έχουν <b> καμία τιμή </b>, δηλαδή τα περιστατικά τους είναι μηδέν. Για αυτό, οι κενές τιμές αντικαταστάθηκαν με 0 και οδηγούν σε εγκυρότερη ανάλυση. Το ίδιο ισχύει και για τις στήλες με τον κάθε τύπο καταστροφής ξεχωριστά. Οι κενές τιμές αντικαταστάθηκαν από το 0, καθώς δεν έχουν καταγραφεί περιστατικά.\n",
    "\n",
    "Παραδειγματικά λειτούργησε η έρευνα των Mandyam, Sukeerthi & Priya, Shanmuga & Suresh, Shalini & Srinivasan, Kavitha. (2022). A Correlation Analysis and Visualization of Climate Change using Post-Disaster Heterogeneous Datasets. 10.48550/arXiv.2205.12474. που μελετά την συσχέτιση της ανόδου της θερμοκρασίας με τα ακραία φαινόμενα."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9474ef22-bc0e-4c93-9a03-61fa859fe35f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
